DataProcessors/ПоискРезюмеВИнтернете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПоискРезюмеВИнтернете</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВозрастДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозрастОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевоеСлово</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньЗарплатыДо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньЗарплатыОт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньОбразования</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРазмещения</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВНазвании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьРезюмеБезЗарплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НайденныеКандидаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НазваниеРезюме</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГдеНайден</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньЗарплаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возраст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пол</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнееМестоРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРезюме</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСортировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРазмещения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаРезюме</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СертификатыПоСпециальностиФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СертификатыПоСпециальностиФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ПоискРезюмеВИнтернете/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузитьОбщиеСправочники() Экспорт
	
	Если ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("КлассификаторыОбщие") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлассификаторыОбщие = Новый Соответствие;
	ТабличныйДокумент = Обработки.ПоискРезюмеВИнтернете.ПолучитьМакет("Классификаторы");
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ТабличныйДокумент.ПолучитьТекст());
	
	Чтение.Прочитать();
	
	Псевдоним = "";
	ТекущийСправочник = Новый Соответствие;
	
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента 
			И Чтение.Имя = "Dictionary" Тогда
			
			Псевдоним = Чтение.ПолучитьАтрибут("ID");
			ТекущийСправочник = Новый Соответствие;
			
		КонецЕсли;
		
		Если Чтение.Имя = "Item" Тогда
			
			Ключ = Чтение.ПолучитьАтрибут("Code");
			Представление = Чтение.ПолучитьАтрибут("Name");
			
			ТекущийСправочник.Вставить(Ключ, Представление);
			
		КонецЕсли;
			
		Если Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента 
			И Чтение.Имя = "Dictionary" Тогда
			КлассификаторыОбщие.Вставить(Псевдоним, ТекущийСправочник);
		КонецЕсли;
		
	КонецЦикла;
	
	Чтение.Закрыть();
	
	СправочникиФикс = ОбщегоНазначения.ФиксированныеДанные(КлассификаторыОбщие);
	
	ТекущиеПараметры =
		РекрутинговыеСайтыСлужебный.СоответствиеПоФиксированномуСоответствию(ПараметрыСеанса.ПараметрыКлиентаНаСервере);
	ТекущиеПараметры.Вставить("КлассификаторыОбщие", СправочникиФикс);
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(ТекущиеПараметры);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПоискКандидатов(СтрокаПоиска, ОтборыСКД) Экспорт
	
	МассивКандидатов = Новый Массив;
	
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		ВыполнитьПолнотекстовыйПоиск(СтрокаПоиска, МассивКандидатов);
		Если МассивКандидатов.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаРезультатаСКД = ТаблицаСКД(МассивКандидатов, ОтборыСКД);
	
	Если ТаблицаРезультатаСКД.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультатаСКД.Свернуть("Кандидат,ЛичныеДанныеКандидата,ФизическоеЛицо");
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультатаПоиска(ТаблицаРезультатаСКД));
	
КонецФункции

Процедура ВыполнитьПолнотекстовыйПоиск(СтрокаПоиска, МассивКандидатов)
	
	РазмерПорции = 200;
	РезультатПП = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоиска, РазмерПорции);
	
	МассивОбластейПоиска = Новый Массив;
	МассивОбластейПоиска.Добавить(Метаданные.Справочники.Кандидаты);
	МассивОбластейПоиска.Добавить(Метаданные.Справочники.КандидатыПрисоединенныеФайлы);
	МассивОбластейПоиска.Добавить(Метаданные.Справочники.ЛичныеДанныеКандидатов);
	МассивОбластейПоиска.Добавить(Метаданные.Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы);
	МассивОбластейПоиска.Добавить(Метаданные.Справочники.ФизическиеЛица);
	МассивОбластейПоиска.Добавить(Метаданные.Справочники.ФизическиеЛицаПрисоединенныеФайлы);
	МассивОбластейПоиска.Добавить(Метаданные.Справочники.ОбразованиеФизическихЛиц);
	МассивОбластейПоиска.Добавить(Метаданные.РегистрыСведений.ТрудоваяДеятельностьФизическихЛиц);
	МассивОбластейПоиска.Добавить(Метаданные.РегистрыСведений.ХарактеристикиФизическихЛиц);
	МассивОбластейПоиска.Добавить(Метаданные.РегистрыСведений.УченыеЗванияФизическихЛиц);
	МассивОбластейПоиска.Добавить(Метаданные.РегистрыСведений.УченыеСтепениФизическихЛиц);
	МассивОбластейПоиска.Добавить(Метаданные.РегистрыСведений.ДанныеПоискаФизическихЛиц);
	МассивОбластейПоиска.Добавить(Метаданные.РегистрыСведений.СпециальностиФизическихЛиц);
	МассивОбластейПоиска.Добавить(Метаданные.РегистрыСведений.ТекущиеКадровыеДанныеСотрудников);
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.ВоинскиеСпециальныеЗвания") Тогда
		МассивОбластейПоиска.Добавить(Метаданные.НайтиПоПолномуИмени("РегистрСведений.ВоинскиеСпециальныеЗванияФизическихЛиц"));
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.СертификатыПоСпециальностиФизическихЛиц") Тогда
		МассивОбластейПоиска.Добавить(Метаданные.НайтиПоПолномуИмени("РегистрСведений.СертификатыПоСпециальностиФизическихЛиц"));
	КонецЕсли;
	
	МассивЛичныхДанныхКандидатов = Новый Массив;
	МассивФизическихЛиц = Новый Массив;
	
	РезультатПП.ОбластьПоиска = МассивОбластейПоиска;
	РезультатПП.ПолучатьОписание = Ложь;
	РезультатПП.ПолучатьПредставление = Ложь;
	
	РезультатПП.ПерваяЧасть();
	КоличествоЭлементов = РезультатПП.ПолноеКоличество();
	НачальнаяПозиция = 0;
	КонечнаяПозиция = ?(КоличествоЭлементов > РазмерПорции, РазмерПорции, КоличествоЭлементов)-1;
	ЕстьСледующаяПорция = Истина;
	
	Пока ЕстьСледующаяПорция Цикл
		Для СчетчикЭлементов = 0 По КонечнаяПозиция Цикл
			ЭлементПоиска = РезультатПП.Получить(СчетчикЭлементов);
			Если ТипЗнч(ЭлементПоиска.Значение) = Тип("СправочникСсылка.Кандидаты") Тогда
				МассивКандидатов.Добавить(ЭлементПоиска.Значение);
			ИначеЕсли ТипЗнч(ЭлементПоиска.Значение) = Тип("СправочникСсылка.КандидатыПрисоединенныеФайлы") Тогда
				МассивКандидатов.Добавить(
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементПоиска.Значение, "ВладелецФайла"));
			ИначеЕсли ТипЗнч(ЭлементПоиска.Значение) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
				МассивЛичныхДанныхКандидатов.Добавить(ЭлементПоиска.Значение);
			ИначеЕсли ТипЗнч(ЭлементПоиска.Значение) = Тип("РегистрСведенийКлючЗаписи.ХарактеристикиФизическихЛиц") Тогда
				МассивЛичныхДанныхКандидатов.Добавить(ЭлементПоиска.Значение.ФизическоеЛицо);
			ИначеЕсли ТипЗнч(ЭлементПоиска.Значение) =
				Тип("СправочникСсылка.ЛичныеДанныеКандидатовПрисоединенныеФайлы") Тогда
				МассивЛичныхДанныхКандидатов.Добавить(
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементПоиска.Значение, "ВладелецФайла"));
			ИначеЕсли ТипЗнч(ЭлементПоиска.Значение) = Тип("РегистрСведенийКлючЗаписи.ДанныеПоискаФизическихЛиц") Тогда
				МассивЛичныхДанныхКандидатов.Добавить(ЭлементПоиска.Значение.ФизическоеЛицо);
			ИначеЕсли ТипЗнч(ЭлементПоиска.Значение) = Тип("СправочникСсылка.ФизическиеЛицаПрисоединенныеФайлы") Тогда
				МассивФизическихЛиц.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементПоиска.Значение,
					"ВладелецФайла"));
			ИначеЕсли ТипЗнч(ЭлементПоиска.Значение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				МассивФизическихЛиц.Добавить(ЭлементПоиска.Значение);
			ИначеЕсли ТипЗнч(ЭлементПоиска.Значение) = Тип("СправочникСсылка.ОбразованиеФизическихЛиц") Тогда
				МассивФизическихЛиц.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементПоиска.Значение,
					"Владелец"));
			Иначе
				МассивФизическихЛиц.Добавить(ЭлементПоиска.Значение.ФизическоеЛицо);
			КонецЕсли;
		КонецЦикла;
		НачальнаяПозиция = НачальнаяПозиция + РазмерПорции;
		ЕстьСледующаяПорция = (НачальнаяПозиция < КоличествоЭлементов - 1);
		Если ЕстьСледующаяПорция Тогда
			КонечнаяПозиция = 
			?(КоличествоЭлементов > НачальнаяПозиция + РазмерПорции, РазмерПорции,
			КоличествоЭлементов - НачальнаяПозиция) - 1;
			РезультатПП.СледующаяЧасть();
		КонецЕсли;
	КонецЦикла;
	
	Если МассивЛичныхДанныхКандидатов.Количество() > 0 Тогда
		Кандидаты = ПодборПерсонала.КандидатыПоЛичнымДаннымКандидатов(МассивЛичныхДанныхКандидатов).ВыгрузитьКолонку(
			"Кандидат");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКандидатов, Кандидаты, Истина);
	КонецЕсли;
	
	Если МассивФизическихЛиц.Количество() > 0 Тогда
		Кандидаты = ПодборПерсонала.КандидатыФизическихЛиц(МассивФизическихЛиц).ВыгрузитьКолонку("Кандидат");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивКандидатов, Кандидаты, Истина);
	КонецЕсли;
	
	МассивКандидатов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивКандидатов);
	
КонецПроцедуры

Функция ТаблицаРезультатаПоиска(ДанныеКандидатов)
	
	ТаблицаРезультат = Новый ТаблицаЗначений();
	ТаблицаРезультат.Колонки.Добавить("Представление");
	ТаблицаРезультат.Колонки.Добавить("Фото");
	ТаблицаРезультат.Колонки.Добавить("Кандидат");
	ТаблицаРезультат.Колонки.Добавить("ФизическоеЛицо");
	
	ФизическиеЛица = Новый Массив;
	Кандидаты = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ДанныеКандидатов Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ФизическоеЛицо)
			И УправлениеДоступом.ЧтениеРазрешено(СтрокаТаблицы.ФизическоеЛицо) Тогда
			ФизическиеЛица.Добавить(СтрокаТаблицы.ФизическоеЛицо);
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицы.Кандидат)
			И УправлениеДоступом.ЧтениеРазрешено(СтрокаТаблицы.Кандидат) Тогда
			Кандидаты.Добавить(СтрокаТаблицы.Кандидат);
		КонецЕсли;
	КонецЦикла;
	
	ФизическиеЛица = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ФизическиеЛица);
	Кандидаты = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Кандидаты);
	
	ИсторияВзаимоотношений = СотрудникиФормы.ИсторияВзаимоотношенийСКомпанией(ФизическиеЛица);
	ПодборПерсонала.ДополнитьИсториюВзаимоотношенийКандидатами(ИсторияВзаимоотношений, Кандидаты);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ИсторияВзаимоотношений, "Ссылка");
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ИсторияВзаимоотношений, "ФизическоеЛицо");
	
	ФотографииФизическихЛиц = КадровыйУчетРасширенный.АдресаФотографийФизическихЛиц(ФизическиеЛица);
	ФотографииКандидатов = ПодборПерсонала.АдресаФотографийКандидатов(Кандидаты);
	
	Для Каждого СтрокаТаблицы Из ДанныеКандидатов Цикл
		НайденныеСтроки = ИсторияВзаимоотношений.НайтиСтроки(Новый Структура("Кандидат", СтрокаТаблицы.Кандидат));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаВзаимоотношений = НайденныеСтроки[0];
		Строка = ТаблицаРезультат.Добавить();
		Строка.Кандидат = СтрокаТаблицы.Кандидат;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ФизическоеЛицо) Тогда
			Строка.ФизическоеЛицо = СтрокаТаблицы.ФизическоеЛицо;
			ДатаРождения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.ФизическоеЛицо, "ДатаРождения", Истина);
			Фотография = Фотография(ФотографииФизическихЛиц, СтрокаТаблицы.ФизическоеЛицо);
			ПредставлениеОбъекта = Строка(СтрокаТаблицы.ФизическоеЛицо);
		Иначе
			ДатаРождения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Кандидат,
				"ЛичныеДанные.ДатаРождения", Истина);
			Фотография = Фотография(ФотографииКандидатов, СтрокаТаблицы.Кандидат);
			ПредставлениеОбъекта = Строка(СтрокаТаблицы.Кандидат);
		КонецЕсли;
		
		Если ДатаРождения = Неопределено Тогда
			Возраст = "";
		Иначе
			Возраст = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ПредставлениеВозраста(ДатаРождения, ТекущаяДатаСеанса());
		КонецЕсли;
		
		Строка.Представление = СтрШаблон(НСтр("ru = '%1, %2%3'"),
			ПредставлениеОбъекта,
			?(ЗначениеЗаполнено(Возраст), Возраст + ", ", ""),
			НРег(Лев(СтрокаВзаимоотношений.Примечание, 1)) + Сред(СтрокаВзаимоотношений.Примечание, 2));
		Строка.Фото = Фотография;
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция Фотография(ВсеФотографии, Объект)
	
	Фотография = ВсеФотографии[Объект];
	
	Если Фотография = Неопределено Тогда
		Возврат БиблиотекаКартинок.Силуэт;
	КонецЕсли;

	АдресФотографии = ПолучитьИзВременногоХранилища(Фотография);
	Возврат ?(ТипЗнч(АдресФотографии) = Тип("Картинка"), АдресФотографии, Новый Картинка(АдресФотографии));

КонецФункции

Функция ТаблицаСКД(МассивКандидатов, ОтборыСКД)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СхемаКомпоновкиДанных = Обработки.ПоискРезюмеВИнтернете.ПолучитьМакет("ВнутреннийПоиск");
	
	ИспользоватьОтборКандидатов = ?(МассивКандидатов.Количество() > 0, Истина, Ложь);
	ПараметрИспользоватьОтбор = СхемаКомпоновкиДанных.Параметры.Найти("ИспользоватьОтборКандидатов");
	ПараметрИспользоватьОтбор.Значение = ИспользоватьОтборКандидатов;
	
	Если ИспользоватьОтборКандидатов Тогда
		ПараметрМассивКандидатов = СхемаКомпоновкиДанных.Параметры.Найти("МассивКандидатов");
		ПараметрМассивКандидатов.Значение = МассивКандидатов;
	КонецЕсли;
	
	ПараметрПериод = СхемаКомпоновкиДанных.Параметры.Найти("Период");
	ПараметрПериод.Значение = ТекущаяДатаСеанса();
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьЗапросыКПредставлениямВиртуальныхТаблиц(
		СхемаКомпоновкиДанных.НаборыДанных[0].Запрос, СхемаКомпоновкиДанных);
	
	НастройкиСКД = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки;
	
	УстановитьОтборыСКД(НастройкиСКД, ОтборыСКД);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиСКД,,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,,Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Возврат ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецФункции

Процедура УстановитьОтборыСКД(Настройки, Отборы)

	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		Настройки.Отбор, НСтр("ru = 'Отбор по области поиска'"), ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	Если Отборы.ОбластьПоискаКандидаты Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ГруппаОтбора,
			"СостояниеКандидата",
			Перечисления.СостоянияСогласования.Согласовано,
			ВидСравненияКомпоновкиДанных.НеРавно);
	КонецЕсли;
	
	Если Отборы.ОбластьПоискаСотрудники Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ГруппаОтбора,
			"ДатаПриема",
			Неопределено,
			ВидСравненияКомпоновкиДанных.Заполнено);
	КонецЕсли;
	
	Если Отборы.ОбластьПоискаУволенные Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ГруппаОтбора,
			"ДатаУвольнения",
			Неопределено,
			ВидСравненияКомпоновкиДанных.Заполнено);
	КонецЕсли;
	
	Если Отборы.ОбластьПоискаКадровыйРезерв Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ГруппаОтбора,
			"ФизическоеЛицоКадровыйРезерв",
			Неопределено,
			ВидСравненияКомпоновкиДанных.Заполнено);
	КонецЕсли;
	
	Если Отборы.ПолФизическогоЛица <> Перечисления.ПолФизическогоЛица.ПустаяСсылка() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"Пол",
			Отборы.ПолФизическогоЛица);
	КонецЕсли;
	
	Если Отборы.ИспользоватьВозраст Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"Возраст",
			Отборы.ВозрастФизическогоЛицаОт,
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
		Если Отборы.ВозрастФизическогоЛицаДо > 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
				Настройки.Отбор,
				"Возраст",
				ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
				Отборы.ВозрастФизическогоЛицаДо);
		КонецЕсли;
	КонецЕсли;
	
	Если Отборы.ИспользоватьГражданство Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"Гражданство",
			Отборы.ОтборГражданствоСписок);
	КонецЕсли;
	
	Если Отборы.ИспользоватьЗнаниеЯзыков Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"Язык",
			Отборы.ЗнаниеЯзыковСписок);
	КонецЕсли;
	
	Если Отборы.ИспользоватьСостояниеВБраке Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"СостояниеВБраке",
			Отборы.СостояниеВБракеСписок);
	КонецЕсли;
	
	Если Отборы.ИспользоватьОпытРаботы Тогда
		ОпытРаботы = Число(Отборы.ОпытРаботы);
		Если ОпытРаботы = ОпытРаботыФизическогоЛица().БезОпыта Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				Настройки.Отбор,
				"ОбщийСтажЛет",
				Неопределено,
				ВидСравненияКомпоновкиДанных.НеЗаполнено);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				Настройки.Отбор,
				"ОбщийСтажЛет",
				ОпытРаботы,
				ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
		КонецЕсли;
	КонецЕсли;
	
	Если Отборы.ИспользоватьУровеньЗарплатыФизическогоЛица Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"ОжидаемыйДоход",
			Отборы.УровеньЗарплатыФизическогоЛицаОт,
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
		Если Отборы.УровеньЗарплатыФизическогоЛицаДо > 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
				Настройки.Отбор,
				"ОжидаемыйДоход",
				ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
				Отборы.УровеньЗарплатыФизическогоЛицаДо);
		КонецЕсли;
	КонецЕсли;
	
	Если Отборы.СкрыватьРезюмеФизическогоЛицаБезЗарплаты Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"ОжидаемыйДоход",
			Неопределено,
			ВидСравненияКомпоновкиДанных.Заполнено);
	КонецЕсли;
	
	Если Отборы.ИспользоватьУровеньОбразованияФизическогоЛица Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"ВидОбразования",
			Отборы.УровеньОбразованияСписок);
	КонецЕсли;
	
	Если Отборы.ИспользоватьУчебноеЗаведение Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"УчебноеЗаведение",
			Отборы.ОтборУчебноеЗаведениеСписок);
	КонецЕсли;
	
	Если Отборы.ИспользоватьПрофессию Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"Профессия",
			Отборы.ОтборПрофессияСписок);
	КонецЕсли;
	
	Если Отборы.ИспользоватьСпециальность Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"Специальность",
			Отборы.ОтборСпециальностьСписок);
	КонецЕсли;
	
	Если Отборы.ИспользоватьПрофильДолжности Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"ПрофильДолжности",
			Отборы.ОтборПрофильДолжностиСписок);
	КонецЕсли;
	
	Если Отборы.ИспользоватьКомпетенции Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"Характеристика",
			Отборы.КомпетенцииСписок);
	КонецЕсли;
	
	Если Отборы.ИспользоватьПричинаОтклонения Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"ПричинаОтклонения",
			Отборы.ПричинаОтклоненияСписок);
	КонецЕсли;
	
	Если Отборы.ИспользоватьЭтапРаботы Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"ТекущийЭтап",
			Отборы.ЭтапРаботыСписок);
	КонецЕсли;
	
	Если Отборы.ИспользоватьОтветственныйРекрутер Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"ОтветственныйРекрутер",
			Отборы.ОтборОтветственныйРекрутерСписок);
	КонецЕсли;
	
	Если Отборы.ИспользоватьРейтингКандидата Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			"СреднийРейтинг",
			Отборы.РейтингКандидатаОт,
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
		Если Отборы.РейтингКандидатаДо > 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
				Настройки.Отбор,
				"СреднийРейтинг",
				ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
				Отборы.РейтингКандидатаДо);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьОтборыПоСвойствамОбъектов(Настройки, Отборы);
	
КонецПроцедуры

Процедура УстановитьОтборыПоСвойствамОбъектов(Настройки, Отборы)
	
	Для Каждого ВидОбъекта Из Отборы.ВидыОбъектов Цикл
		
		Для Каждого Свойство Из Отборы["Свойства" +ВидОбъекта] Цикл
			
			ТипЗначения = Свойство.ТипЗначения;
			ИмяПоляПоВидуОбъекта = ИменаПолейПоВидамОбъектов()[ВидОбъекта];
			ИмяПоляСКД = СтрШаблон("%1.[%2]", ИмяПоляПоВидуОбъекта, Свойство.Заголовок);
			ЗначениеСвойства = Отборы["Значения"+ ВидОбъекта][Свойство.Имя + ВидОбъекта];
			Если ТипЗначения.Типы().Количество() = 1 Тогда
				Если ТипЗначения.СодержитТип(Тип("Число")) Тогда
					УстановитьОтборДляСвойстваЧисло(Настройки, ИмяПоляСКД, ЗначениеСвойства);
				ИначеЕсли ТипЗначения.СодержитТип(Тип("Дата")) Тогда
					УстановитьОтборДляСвойстваДата(Настройки, ИмяПоляСКД, ЗначениеСвойства);
				ИначеЕсли ТипЗначения.СодержитТип(Тип("Булево")) Тогда
					УстановитьОтборДляСвойстваБулево(Настройки, ИмяПоляСКД, ЗначениеСвойства);
				Иначе
					УстановитьОтборДляСвойства(Настройки, ИмяПоляСКД, ЗначениеСвойства);
				КонецЕсли;
			Иначе
				УстановитьОтборДляСвойства(Настройки, ИмяПоляСКД, ЗначениеСвойства);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьОтборДляСвойства(Настройки, ИмяПоляСКД, ЗначениеСвойства)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Настройки.Отбор,
		ИмяПоляСКД,
		ЗначениеСвойства);
	
КонецПроцедуры

Процедура УстановитьОтборДляСвойстваЧисло(Настройки, ИмяПоляСКД, ЗначениеСвойства)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Настройки.Отбор,
		ИмяПоляСКД,
		ЗначениеСвойства.От,
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	ЗначениеДо = ЗначениеСвойства.До;
	Если ЗначениеДо > 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			Настройки.Отбор,
			ИмяПоляСКД,
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
			ЗначениеДо);
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьОтборДляСвойстваБулево(Настройки, ИмяПоляСКД, ЗначениеСвойства)
	
	Если ЗначениеСвойства Тогда
		УстановитьОтборДляСвойства(Настройки, ИмяПоляСКД, ЗначениеСвойства);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Настройки.Отбор,
			ИмяПоляСКД,
			Неопределено,
			ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОтборДляСвойстваДата(Настройки, ИмяПоляСКД, ЗначениеСвойства)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Настройки.Отбор,
		ИмяПоляСКД,
		ЗначениеСвойства.С,
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	ЗначениеПо = ЗначениеСвойства.По;
	Если ЗначениеЗаполнено(ЗначениеСвойства.По) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			Настройки.Отбор,
			ИмяПоляСКД,
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
			ЗначениеПо);
	КонецЕсли;
	
КонецПроцедуры

Функция ОпытРаботыФизическогоЛица() Экспорт
	
	ОпытРаботы = Новый Структура;
	ОпытРаботы.Вставить("БезОпыта", 0);
	ОпытРаботы.Вставить("Более1Года", 1);
	ОпытРаботы.Вставить("Более3Лет", 3);
	ОпытРаботы.Вставить("Более6Лет", 6);
	
	Возврат ОпытРаботы;
	
КонецФункции

Функция ИменаПолейПоВидамОбъектов()
	
	ИменаПолей = Новый Структура;
	ИменаПолей.Вставить("ФизическиеЛица", "ФизическоеЛицо");
	ИменаПолей.Вставить("Кандидаты", "Кандидат");
	ИменаПолей.Вставить("Сотрудники", "Сотрудник");
	
	Возврат ИменаПолей;
	
КонецФункции

#КонецОбласти

#КонецЕсли
